[VCP_Tempest X2EncyclopediaTemplate]
ListTitle = "风暴师"
DescriptionTitle = "风暴师"
DescriptionEntry = "灵能风暴之主——风暴师们驾驭雷霆之怒与寒冰桎梏，以摧枯拉朽之势席卷敌阵。他们挥洒灵能灌注的霜寒与雷电，令多路敌军深陷迟滞、碎裂与电击之苦，顷刻间将战场化作冰霜肆虐的毁灭漩涡."

[VCP_Tempest X2SoldierClassTemplate]
DisplayName="风暴师"
ClassSummary = "灵能风暴之主——风暴师执掌雷霆狂怒与寒冰桎梏，以摧枯拉朽之势横扫敌群。他们挥洒灵能充盈的霜寒与雷电轰击，令多路敌军深陷迟滞、碎裂与电击之苦，顷刻间将战场化作冰霜肆虐的毁灭漩涡."

;***************************************
;New Ability Descriptions
;***************************************

;Frost Tempest Ability
[VCP_TempestMastery X2AbilityTemplate]
LocFriendlyName = "风暴掌控"
LocHelpText = " <Ability:ClassName/> 随经验积累提升其能力."
LocLongDescription = " <Ability:ClassName/> 随经验积累提升其能力."
LocPromotionPopupText = "<font color='#CA7200'>1级</font>获得<Ability:RANKNAME1/> 等级 [1]<br/><Bullet/>获得<font color='#bf80ff'>压迫感</font> - 灵能能力每40点灵能攻击力可额外造成+1点伤害.<br/><Bullet/> 同时解锁『撕裂』与『专注』技能.<br/><br/><font color='#CA7200'>2级</font>获得<Ability:RANKNAME3/> 等级 [3]<br/><Bullet/>获得<font color='#bf80ff'>伏特</font> - 消耗1点专注的强力灵能攻击.<br/><br/><font color='#CA7200'>3级</font>获得<Ability:RANKNAME5/> 等级 [5]<br/><Bullet/>获得<font color='#bf80ff'>偏转</font> - 有概率格挡即将到来的远程伤害。格挡概率随专注等级提升而增加.<br/><br/><font color='#CA7200'>4级</font>获得<Ability:RANKNAME7/> 等级 [7]<br/><Bullet/>获得<font color='#bf80ff'>Reflect</font> - 当攻击被偏转时，有概率将伤害反弹回攻击者."

[VCP_PsiPower X2AbilityTemplate]
LocFriendlyName="压迫感"
LocLongDescription="你的攻击额外造成+1点伤害 <font color='#bf80ff'>灵能</font>每40点灵能攻击力对应一项能力."
LocHelpText="你的攻击额外造成+1点伤害 <font color='#bf80ff'>灵能</font>每40点灵能攻击力对应一项能力."
LocFlyOverText="压迫感"
